
## 🏗️ Terraform Check Results

### Validation: ✅ Passed
### Plan: ✅ Passed

<details>
<summary>Show Terraform Plan Output</summary>

```terraform
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a125858a3a61cbd4]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-06cd25d29d0dd7857]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-09d66c45e8f37c6f1]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0bd56aea639c283c2]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-08d930c716c637a68]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-04e3c2f0980533f40]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0dfb2721971a9979c]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0676c1436243ffbd2]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07e1e954ae949c329]
module.aurora.aws_security_group.this[0]: Refreshing state... [id=sg-0dc102b04a47f2e62]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e4f9854af71a7f91]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0d6b49dfa85cb8d80]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a5e7a6a06fa6d177]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0bd56aea639c283c21080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a9773ffd48aa3fff]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03461e7810dbb9caf]
module.aurora.aws_db_subnet_group.this[0]: Refreshing state... [id=aws-quiz-aurora]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-08423f2dcac5c598b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01ff7dbb7421df0c7]
module.aurora.aws_rds_cluster.this[0]: Refreshing state... [id=aws-quiz-aurora]
module.aurora.aws_rds_cluster_instance.this["writer"]: Refreshing state... [id=aws-quiz-aurora-writer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aurora.aws_rds_cluster.this[0] must be replaced
-/+ resource "aws_rds_cluster" "this" {
      ~ allocated_storage                     = 1 -> (known after apply)
      ~ arn                                   = "arn:aws:rds:ap-northeast-1:841162714284:cluster:aws-quiz-aurora" -> (known after apply)
      ~ availability_zones                    = [
          - "ap-northeast-1a",
          - "ap-northeast-1c",
          - "ap-northeast-1d",
        ] -> (known after apply)
      + ca_certificate_identifier             = (known after apply)
      + ca_certificate_valid_till             = (known after apply)
      + cluster_identifier_prefix             = (known after apply)
      ~ cluster_members                       = [
          - "aws-quiz-aurora-writer",
        ] -> (known after apply)
      ~ cluster_resource_id                   = "cluster-CLJB7OMG2BNDRUADUENNHPWRGU" -> (known after apply)
      + cluster_scalability_type              = (known after apply)
      ~ database_insights_mode                = "standard" -> (known after apply)
      ~ db_cluster_parameter_group_name       = "default.aurora-mysql8.0" -> (known after apply)
      + db_system_id                          = (known after apply)
      - deletion_protection                   = false -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "aws-quiz-aurora.cluster-c7k0ycmie43y.ap-northeast-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
      ~ engine_mode                           = "provisioned" -> "serverless" # forces replacement
      ~ engine_version_actual                 = "8.0.mysql_aurora.3.08.1" -> (known after apply)
      ~ hosted_zone_id                        = "Z24O6O9L7SGTNB" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ iam_roles                             = [] -> (known after apply)
      ~ id                                    = "aws-quiz-aurora" -> (known after apply)
      - iops                                  = 0 -> null
      ~ kms_key_id                            = "arn:aws:kms:ap-northeast-1:841162714284:key/f8316942-1255-46e7-9e71-73d2e6b7879f" -> (known after apply)
      ~ master_user_secret                    = [
          - {
              - kms_key_id    = "arn:aws:kms:ap-northeast-1:841162714284:key/a6f4cc67-01a1-4008-a55d-6e91fd7928ff"
              - secret_arn    = "arn:aws:secretsmanager:ap-northeast-1:841162714284:secret:rds!cluster-3b0653eb-5fe5-4be0-9511-a06f3f09947d-crWqYj"
              - secret_status = "active"
            },
        ] -> (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      ~ monitoring_interval                   = 0 -> (known after apply)
      + monitoring_role_arn                   = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      - performance_insights_enabled          = false -> null
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ preferred_backup_window               = "02:00-03:00" -> (known after apply)
      ~ preferred_maintenance_window          = "sun:05:00-sun:06:00" -> (known after apply)
      ~ reader_endpoint                       = "aws-quiz-aurora.cluster-ro-c7k0ycmie43y.ap-northeast-1.rds.amazonaws.com" -> (known after apply)
      + storage_type                          = (known after apply)
      - tags                                  = {} -> null
        # (22 unchanged attributes hidden)

      - serverlessv2_scaling_configuration {
          - max_capacity             = 4 -> null
          - min_capacity             = 0 -> null
          - seconds_until_auto_pause = 300 -> null
        }

        # (1 unchanged block hidden)
    }

  # module.aurora.aws_rds_cluster_instance.this["writer"] will be destroyed
  # (because key ["writer"] is not in for_each map)
  - resource "aws_rds_cluster_instance" "this" {
      - apply_immediately                     = true -> null
      - arn                                   = "arn:aws:rds:ap-northeast-1:841162714284:db:aws-quiz-aurora-writer" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "ap-northeast-1c" -> null
      - ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> null
      - cluster_identifier                    = "aws-quiz-aurora" -> null
      - copy_tags_to_snapshot                 = false -> null
      - db_parameter_group_name               = "default.aurora-mysql8.0" -> null
      - db_subnet_group_name                  = "aws-quiz-aurora" -> null
      - dbi_resource_id                       = "db-23DJLB3PQXEVP2FMURDY2JKMVY" -> null
      - endpoint                              = "aws-quiz-aurora-writer.c7k0ycmie43y.ap-northeast-1.rds.amazonaws.com" -> null
      - engine                                = "aurora-mysql" -> null
      - engine_version                        = "8.0.mysql_aurora.3.08.1" -> null
      - engine_version_actual                 = "8.0.mysql_aurora.3.08.1" -> null
      - force_destroy                         = false -> null
      - id                                    = "aws-quiz-aurora-writer" -> null
      - identifier                            = "aws-quiz-aurora-writer" -> null
      - instance_class                        = "db.serverless" -> null
      - kms_key_id                            = "arn:aws:kms:ap-northeast-1:841162714284:key/f8316942-1255-46e7-9e71-73d2e6b7879f" -> null
      - monitoring_interval                   = 0 -> null
      - network_type                          = "IPV4" -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 3306 -> null
      - preferred_backup_window               = "02:00-03:00" -> null
      - preferred_maintenance_window          = "sun:05:00-sun:06:00" -> null
      - promotion_tier                        = 0 -> null
      - publicly_accessible                   = false -> null
      - region                                = "ap-northeast-1" -> null
      - storage_encrypted                     = true -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "Owner"   = "atsushi-komura"
          - "Project" = "aws-quiz"
        } -> null
      - writer                                = true -> null

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @komura-athushi, Action: `pull_request`*
